[
  {
    "name": "Les Aria, PhD",
    "title": "Pain Psychologist",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/00c42f15-5b31-4598-9f16-87a0e494fd95/Screenshot+2025-04-16+at+12.57.05%E2%80%AFPM.png?format=2500w",
    "bio": "Les Aria, PhD, is a pain psychologist with over 22 years of experience in chronic pain and mind-body medicine. He formerly served as the Lead Pain Psychologist for a major healthcare system in Northern California, where he redesigned the chronic pain curriculum to include modern pain neuroscience and mind-body approaches.\n\n\n  Dr. Aria is currently the Senior Psychology Consultant at The Pointe Malibu and co-founder of Menda Health. His work focuses on evidence-based mind-body interventions to support pain recovery.",
    "local_image_path": "images/Les_Aria_PhD.png"
  },
  {
    "name": "Yonit Arthur, AuD",
    "title": "Doctor of Audiology & Coach",
    "subtitle": "Founder of The Steady Coach",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/02f78a0a-036d-4dcf-a29e-9422a1d330d1/yonit+arthur+headshot+4-25.jpg?format=2500w",
    "bio": "Dr. Yonit Arthur, AuD is a board-certified audiologist, vestibular specialist, and coach who specializes in helping people with chronic dizziness and other vestibular symptoms. Known as “Dr. Yo,” she is certified in advanced vestibular rehabilitation and concussion treatment through the American Institute of Balance and is also a certified strength coach.\n\n\n  She has received training in multiple treatments for neuroplastic and functional neurologic disorders, and extensive training in counseling methods including inferential cognitive behavioral therapy and Internal Family Systems.\n\n\n  Dr. Yo is deeply committed to providing accessible resources and education. Her YouTube channel features hundreds of educational videos, and she offers a comprehensive free course on her website.\n\n\n  The Steady Coach",
    "local_image_path": "images/Yonit_Arthur_AuD.jpg"
  },
  {
    "name": "Lillian Bailey, MS, LMFT, CST",
    "title": "Licensed Marriage and Family Therapist",
    "subtitle": "AASECT-Certified Sex Therapist",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/8ccfb430-ba0e-4931-800e-7c66de11b5f2/Lillian+Bailey+Headshot.jpg?format=2500w",
    "bio": "Lillian Bailey is a Licensed Marriage and Family Therapist and an AASECT-Certified Sex Therapist based in Denver, Colorado. She works with individuals and couples in her private practice, Lillian Bailey Therapy. Lillian loves to nerd out about pain, the brain, sex, and relationships. In addition, she is passionate about finding common factors and universal therapeutic processes to help clinicians work more effectively with challenging clinical cases such as those including neuroplastic symptoms and sexual issues.",
    "local_image_path": "images/Lillian_Bailey_MS_LMFT_CST.jpg"
  },
  {
    "name": "Lisa E. Baranik, PhD",
    "title": "Associate Professor",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/57f64b92-42a5-43d4-b12a-d1a19fe883d5/Screenshot+2025-06-02+at+3.13.31%E2%80%AFPM.png?format=2500w",
    "bio": "Lisa E. Baranik is currently an Associate Professor in the Management Department at the University at Albany. Her research focuses on occupational health psychology, focusing on employee stress. Her work has been published in journals such as the Journal of Management, Psychological Bulletin, Journal of Vocational Behavior, Human Resource Management Review, and the Journal of Organizational Behavior. She serves on the editorial board of the Journal of Vocational Behavior and Occupational Health Science.\n\n\n  Lisa received her B.A. in English and Psychology from Bucknell University, her M.A. in Psychological Sciences from James Madison University, and her Ph.D. in Industrial and Organizational Psychology from The University of Georgia. She is a member of the Society for Industrial and Organizational Psychology and the Academy of Management. She enjoys spending time with her husband and daughter in upstate New York.",
    "local_image_path": "images/Lisa_E_Baranik_PhD.png"
  },
  {
    "name": "Vanessa Blackstone, MSW, ACSW",
    "title": "Executive Director, Pain Psychology Center",
    "subtitle": "Co-Author, The Pain Reprocessing Therapy Workbook",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/b2c45c78-0c3f-4ac2-bd74-a9d206d9357e/Screenshot+2025-04-14+at+2.27.44%E2%80%AFPM.png?format=2500w",
    "bio": "Vanessa Blackstone, MSW, ACSW, citizen of the Eastern Band of Cherokee Indians, is the Executive Director of the Pain Psychology Center—the original clinical home of Pain Reprocessing Therapy (PRT). She co-authored The Pain Reprocessing Therapy Workbook (New Harbinger, 2024) and has trained and provided consultation to hundreds of providers in the application of PRT.\n\n\n  In 2025, she was appointed as a faculty member in UCLA’s School of Dentistry Orofacial Pain Department, where she teaches PRT and offers case consultation to dental residents.\n\n\n  Her clinical work focuses on chronic pain recovery, sex therapy, substance use, and mindfulness-based relapse prevention. She also supports cast and crew on film sets as an Onset Wellness Professional, specializing in emotional safety during sensitive content.\n\n\n  A former foster youth and chronic pain survivor, Vanessa is a passionate advocate and speaker, sharing her story to support healing and access to care. She lives in Los Angeles, CA.\n\n\n  Follow her on Instagram @that.therapist",
    "local_image_path": "images/Vanessa_Blackstone_MSW_ACSW.png"
  },
  {
    "name": "Thomas Chelimsky, MD",
    "title": "Tenured Professor of Neurology",
    "subtitle": "Director, VCU Comprehensive Autonomic Center (CAC) and Autonomic Wellness And Research and Education Center (AWARE)",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/937a89d3-37bf-4754-a333-b5d04d4f2f41/Chelimsky+Headshot.jpg?format=2500w",
    "bio": "Dr. Thomas Chelimsky directs the new VCU Comprehensive Autonomic Center, an interdisciplinary program that crosses Neurology, Pediatrics, PM&R, Psychology, Cardiology and others. He enjoys diagnosing and treating all types of autonomic disorders across all age groups, as well as research in this area for which he has been funded by NIH since 2009 to study the interface between chronic pain and autonomic dysregulation through extensive studies using heart rate variability analysis. He has over 90 publications and chapters.\n\n\n  In his initial faculty appointment at Case Western Reserve University under Robert Daroff, he opened the second autonomic lab in the country in 1993. He also directed the Case Pain Center from 1994 to 2004. This experience led to founding and becoming CEO of PainSTakers, an educational company currently dedicated to training doctors, PT’s and behaviorists in the non-pharmacological approach to chronic pain management. His current research focuses on the brain abnormalities that underlie functional autonomic disorders such as postural tachycardia syndrome (POTS) and related overlapping pain conditions.",
    "local_image_path": "images/Thomas_Chelimsky_MD.jpg"
  },
  {
    "name": "Mags Clark-Smith, MA, PGCE, BCPT, BMC Dip.",
    "title": "Pain Relief Movement Specialist",
    "subtitle": "Researcher",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/ee26b2df-d427-4ce0-bbfe-95f5c704d575/image-asset.png?format=2500w",
    "bio": "Mags currently works in private practice as a pain relief movement specialist with a relational approach. Using her experience with a large and diverse caseload, she teaches resolving chronic pain in consultation, delivers guest lectures internationally and runs teacher-training and research programmes. She is one of four editors of Psychophysiological Disorders: Trauma Informed, Interprofessional Diagnosis and Treatment (2019).\n\n\n  Mags has over 25 years’ experience as a lecturer in Movement and Psychology. Her specialist background is in Laban, Body Mind Centering, Contact Improvisation, Authentic Movement, and non-verbal communication. Mags trained with Lissa Rankin MD in 2014 and continues to teach and mentor with her. She initiated chronic pain research in the Neuroscience Department at University College Cork and University College Dublin.\n\n\n  Mags is a Body Control Pilates Supervising Teacher, and lectures on the University of Edinburgh Dance Science Masters course. She is a member of ATNS, The Irish Pain Society and has worked with Chronic Pain Ireland for over 10 years. She enjoys sailing, running, botanical art, and hiking.\n\n\n  resolvingchronicpain.com",
    "local_image_path": "images/Mags_Clark_Smith_MA_PGCE_BCPT_BMC_Dip.png"
  },
  {
    "name": "David Clarke, MD",
    "title": "ATNS President",
    "subtitle": "Gastroenterologist",
    "image_url": "https://images.squarespace-cdn.com/content/v1/5b75908755b02cf7e029e10e/e91eaab6-8403-4f37-97c0-ca0a19edece2/Clarke_David_Photo.jpeg?format=1000w",
    "bio": "David D. Clarke, MD is President of the Association for the Treatment of Neuroplastic Symptoms, Assistant Director at the Center for Ethics and Clinical Assistant Professor of Gastroenterology Emeritus at Oregon Health & Science University in Portland, Oregon. He is board-certified in Gastroenterology and Internal Medicine and has successfully treated over 7000 patients with neuroplastic symptoms. His book They Can’t Find Anything Wrong! was praised by a president of the American Psychosomatic Society as “truly remarkable.” He has also edited three textbooks on neuroplastic symptoms, co-produced three documentary films, lectures internationally, has done hundreds of broadcast interviews and interviews patients on his podcast The Story Behind the Symptoms.\n\nSymptomatic.me",
    "local_image_path": "images/David_Clarke_MD.jpeg"
  },
  {
    "name": "Marcia Dewey, AuD, CCC/A",
    "title": "Audiologist & Tinnitus Specialist",
    "subtitle": "Team Lead, Tinnitus and Hyperacusis Program",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/75c52fd2-0d28-4f6d-a969-de8bcd090836/Photo+Dewey+Marcia+3F0A7323+2023+square+ratio.jpg?format=2500w",
    "bio": "Dr. Marcia Dewey obtained her B.A. in audiology from Michigan State University, her M.A. in audiology from Western Michigan University, and her doctorate in audiology from Salus University. She is currently at the Froedtert & the Medical College of Wisconsin, an academic medical center in Milwaukee, WI. Dr. Dewey has specialized in tinnitus since 2008 and received training in Tinnitus Retraining Therapy (TRT) with Dr. Pawel Jastreboff. She created the Froedtert & MCW Tinnitus and Hyperacusis Program and has been its team lead since 2011.\n\n\n  Her professional focus on tinnitus and sound sensitivity has led her to explore neuroplastic symptoms. Since 2020, she has pursued additional training in Pain Reprocessing Therapy (PRT), Emotional Awareness & Expression Therapy (EAET), Stress Illness and Recovery Practitioner Association (SIRPA) conferences, and ATNS conferences. Dr. Dewey is passionate about working with patients experiencing tinnitus, hyperacusis, misophonia (sound sensitivities), chronic dizziness, and other neuroplastic symptoms.",
    "local_image_path": "images/Marcia_Dewey_AuD_CCCA.jpg"
  },
  {
    "name": "Monica Fitzgerald, PhD",
    "title": "Clinical Psychologist, Senior Research Associate",
    "subtitle": "Center for Resilience + Well-Being Director",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/c2c9afbe-2c34-42bd-88cc-09cdb3bf4a2f/tempImagelh60ND.jpg?format=2500w",
    "bio": "Dr. Fitzgerald is a licensed Clinical Psychologist and Senior Research Associate at the University of Colorado Boulder’s Institute of Behavioral Science (IBS). She directs CU’s Center for Resilience + Well-Being. Dr. Fitzgerald has expertise in child abuse and trauma, child traumatic stress, social emotional development and emotion socialization, parenting, family communication, and evidence-based, trauma-responsive programs for families, educators, and trusted adults. She is a developer of the Let’s ConnectÒ parenting program and Resilience in Schools + Educators (RISE) K-12 school prevention program. Dr. Fitzgerald conducts community-based research on these programs and is a certified national and international trainer/consultant in trauma-focused interventions for youth and families (e.g., TF-CBTÒ, AF-CBTÒ). She also regularly consults with health organizations and school systems regarding trauma-informed practices to support positive climate and culture, well-being, and resilience, and to reduce burnout and secondary traumatic stress. For more information:\n\n\n  https://ibsweb.colorado.edu/crw/people/monica-fitzgerald/",
    "local_image_path": "images/Monica_Fitzgerald_PhD.jpg"
  },
  {
    "name": "Jennifer Franklin, PhD",
    "title": "Psychologist",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/b8d70c34-18ce-42db-b367-450e7660cfd8/Jennifer+C.+Franklin+Headshot.jpg?format=2500w",
    "bio": "One of the first “gastropsychologists” in the US and a thought-leader, Dr. Franklin is an experiential, somatically-oriented, mindfulness-based private-practice psychologist, specializing in the treatment of neuroplastic symptoms, especially digestive conditions like irritable bowel syndrome (IBS) and other disorders of gut-brain interaction.\n\n\n  For over two decades, she has provided psychotherapy, telepsychology, and consultation services to individuals, couples, and families. Dr. Franklin began her career on the heels of having suffered greatly from IBS. A year of psychotherapy as a teenager kick-started her healing process and made her acutely aware of the powerful relationship between mind and body; then over the course of graduate school, she recovered completely.\n\n\n  Originally from Los Angeles, she worked with physicians of the UCLA Center for Neurovisceral Studies before moving to Durham, NC, and working at the UNC Center for Functional GI and Motility Disorders in Chapel Hill. Dr. Franklin has taught Vipassana and mindfulness meditation, served as an associate editor for the Journal of Humanistic Psychology, and presented to physicians, psychotherapists, other health-care professionals, and the public.\n\n\n  Don’t Hate Your Guts",
    "local_image_path": "images/Jennifer_Franklin_PhD.jpg"
  },
  {
    "name": "Michelle Gottlieb, PsyD, LMFT, LPCC",
    "title": "Clinician, Educator & EMDR Trainer",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/8f33f7f4-4fd0-41eb-b069-10b483a94917/web+pr+pic-2014.jpg?format=2500w",
    "bio": "Michelle Gottlieb, Psy.D, LMFT, LPCC is an experienced clinician specializing in complex trauma and chronic pain/illness at her private practice in Fullerton, CA. She is also adjunct faculty in the Counseling Department at Cal State Fullerton, where she has taught in the graduate division for over twenty years with exemplary reviews.\n\n\nMichelle presents internationally on EMDR Therapy and has facilitated trainings for EMDR HAP and the EMDR Institute. She serves as the consultant to the Orange County Trauma Recovery Network (TRN).\n\n\nShe is co-founder, President/CEO, and Senior Trainer at EMDR Professional Training, and co-hosts the podcast EMDR Chat with Curt and Michelle.\n\n\nmichellegottlieb.com",
    "local_image_path": "images/Michelle_Gottlieb_PsyD_LMFT_LPCC.jpg"
  },
  {
    "name": "Rita Gupta, DO MPA",
    "title": "Physician, Pain Reprocessing Coach, Mindfulness Mentor",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/48807b08-2024-4923-a7eb-cef3f0c53165/untitled_20231001_1109.jpeg?format=2500w",
    "bio": "Dr. Gupta is a board-certified physician, expert Pain Reprocessing coach, and certified Mindfulness Mentor. She guides individuals with chronic conditions and pain toward reducing their discomfort and, in many cases, eliminating symptoms altogether. Dr. Gupta is deeply dedicated to this much-needed work and is passionate about helping those who are suffering reclaim their lives.",
    "local_image_path": "images/Rita_Gupta_DO_MPA.jpeg"
  },
  {
    "name": "Paul Hansma, PhD",
    "title": "Researcher, Neuroscience Institute UCSB",
    "subtitle": "Emeritus Professor of Physics, UCSB",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/265cfbff-2a7b-43b0-ba4a-cabff863a305/Paul+Hansma.jpg?format=2500w",
    "bio": "Paul Hansma, PhD, is a physicist at the University of California, Santa Barbara and a researcher in the Neuroscience Research Institute. His current research focuses on a mathematical model for chronic pain and chronic pain recovery studies based on that model. He is also involved in fundamental research in neurobiology and activity of human brain organoids as revealed by multi-electrode arrays. He has over 350 publications, with over 50,000 citations and an H factor of 114. His most recent publications are primarily in neuroscience.\n\n\n  hansmalab.physics.ucsb.edu",
    "local_image_path": "images/Paul_Hansma_PhD.jpg"
  },
  {
    "name": "Marjorie Heule, MS",
    "title": "Clinical Psychology Doctoral Candidate",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/a89a0b78-5eb5-4a94-9eea-398b3abd6a28/Headshot_20230309.jpg?format=2500w",
    "bio": "Marjorie “Marisa” Heule is a fourth-year clinical psychology PhD student at Wayne State University investigating the mind-body connection with Dr. Mark Lumley. Her primary research foci include trauma, emotions, and physical symptoms, particularly in women’s health.  Marisa completed her bachelor’s degree in Political Science, French, and Spanish at Calvin University in Grand Rapids, Michigan and subsequently obtained a master’s in Clinical Research Methods in Psychology at Fordham University in New York. While in New York, she interned with a leading practitioner of mind-body medicine, Dr. Ira Rashbaum, in the treatment of chronic pain. As a doctoral student, Marisa has published several articles investigating sexual abuse and women’s sexual functioning as well as co-authored two articles with Dr. Lumley and Dr. Howard Schubiner on emotion-focused diagnosis and treatment for chronic pain. With the support of a non-profit, Marisa also created and directed a short film on new conceptualizations of chronic pain: Chronic Pain and the Brain. She is currently conducting her doctoral dissertation, which compares the effects of three therapies presented as single-session interventions to people with musculoskeletal pain: CBT, Pain Reprocessing Therapy, and Emotional Awareness and Expression Therapy. In the future, she hopes to continue to find creative ways to test and disseminate effective, mind-body treatments for somatic symptoms.",
    "local_image_path": "images/Marjorie_Heule_MS.jpg"
  },
  {
    "name": "Michael Hodge",
    "title": "Pelvic Health Specialist",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/e6d98b50-6c7c-4f69-b011-7f26ae7d85da/michael_book.jpeg?format=2500w",
    "bio": "After overcoming five years of severe pelvic floor issues and sexual dysfunction, Michael developed Transform Pelvic Health programs which have helped thousands of people address the root cause of their symptoms—freeing their bodies. He is the author of The Root Truth.\n\n\n  www.transformpelvichealth.com",
    "local_image_path": "images/Michael_Hodge.jpeg"
  },
  {
    "name": "Dan Kaufmann, PhD",
    "title": "Research Assistant Professor",
    "subtitle": "Division of Rheumatology, Department of Medicine, Spencer Fox Eccles School of Medicine, University of Utah",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/a60412fe-0a70-4e9b-9dfb-f4be604857e4/Dan+Kaumann+Image+.jpg?format=2500w",
    "bio": "Dr. Dan Kaufmann is a Research Assistant Professor at the University of Utah’s Department of Medicine, Division of Rheumatology. With a Ph.D. in Medicinal Chemistry and Pharmaceutics from the University of Jerusalem, Dr. Kaufmann has significantly contributed to the design and synthesis of novel drugs for treating epilepsy and neuropathic pain. He developed SPD, a novel anticonvulsant and migraine preventive compound. This patented compound has demonstrated great promise in pre-clinical models for epilepsy, neuropathic pain, and migraine.\n\n\n  In recent years, Dr. Kaufmann’s research has focused on the modulation of migraine by sex, stress, and affect. He has broadened his scope to include musculoskeletal pain and fatigue. His current work within the Division of Rheumatology explores the intersection of psychological treatments and rheumatic diseases, reflecting his growing interest in the emotional aspects of chronic pain.\n\n\n  Driven by a desire to integrate both pharmacological and psychological approaches to pain management, Dr. Kaufmann is on track to become a licensed Clinical Mental Health Counselor. He trained extensively in cognitive behavioral hypnotherapy, neurolinguistic programming (NLP), biofeedback, autogenic training, the Unified Protocol, and Emotional Awareness and Expression Therapy (EAET).\n\n\n  Dr. Kaufmann has just completed a study evaluating the effects of EAET on migraine endpoints and the crucial role of trauma in migraine sufferers' emotional experiences. The study showed significant potential for EAET’s unique therapeutic approach in migraine. His long-term goal is to combine his expertise in pharmacology, physiology, and behavior to develop innovative treatments for various pain conditions, including migraine and rheumatology-related pain, ultimately improving the lives of patients dealing with these complex diseases.",
    "local_image_path": "images/Dan_Kaufmann_PhD.jpg"
  },
  {
    "name": "Geoffrey Keenan, MD",
    "title": "Board Certified Physical Medicine and Rehabilitation",
    "subtitle": "Staff Physician Sentara Orthopedics Department | Co-Director of the Neck and Back pain clinic",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/efd6417c-386b-4808-b109-ca20b06376c7/geoff+orthopedics+mug+shot.jpg?format=2500w",
    "bio": "Geoffrey Keenan, M.D. is a Board Certified Physical Medicine and Rehabilitation Physician (Physiatrist)  He has worked in multiple settings including the military, private practice and HMO environments.  He has additional experience, interest, and training in Neuroplastic Pain and Neuroplastic Symptoms.  He currently works in a Orthopedics program at a Regional Hospital system where he works as the Department Head for a Back and Neck Pain Clinic.  He serves as a consultant for physicians throughout the Central Virginia area in assisting with complex medical problems.  He does electrodiagnostics, osteopathic manual therapy, medical acupuncture, pain reprocessing therapy and Emotional Awareness and Expression Therapy as part of his everyday practice.",
    "local_image_path": "images/Geoffrey_Keenan_MD.jpg"
  },
  {
    "name": "Rebecca Kennedy, MD",
    "title": "Family Medicine Physician",
    "subtitle": "Resilience Health Clinic Founder",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/861ab1fd-9e0e-4e10-828b-02eac56405e7/Board+of+Directors+headshot+%282%29.jpg?format=2500w",
    "bio": "Rebecca Kennedy, MD has been a family medicine physician for over 20 years with a lifelong interest in the mind-body connection and the body’s ability to heal itself. She spent 15 years as a physician at Kaiser Permanente in Portland, Oregon, where she developed a deep curiosity and drive to discover more effective ways to support patients whose needs were not fully met by the conventional medical model.\n\n\n  She was the lead of the long COVID specialty group for Kaiser Permanente Northwest where she assessed hundreds of patients with long COVID, restoring many of them to good health. Dr. Kennedy now runs her own clinic called Resilience Health which exclusively focuses on neuroplastic symptoms with a particular focus on long COVID and CFS/ME.\n\n\n  She is a board member of the ATNS as well as a member of the Oslo Chronic Fatigue Consortium.\n\n\n  resilience-healthcare.com",
    "local_image_path": "images/Rebecca_Kennedy_MD.jpg"
  },
  {
    "name": "Alex Klassen, MSW, RSW",
    "title": "Co-Director of MBody Community",
    "subtitle": "Therapist",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/eb7862a3-4b34-4e09-867c-8396e0c3baa3/Alex+Klassen+Headshot.jpg?format=2500w",
    "bio": "Alex focuses on helping clients heal nervous system dysregulation and chronic pain/symptoms by increasing a sense of safety in the mind, body, and environment. Growing up, Alex’s parents experienced chronic pain and fatigue due to traumatic injuries and stress, which informs his compassion and understanding when providing care. Alex practices from the perspective that the person is not the problem; the problem is the problem! From this stance, Alex is very collaborative and curious in each client’s unique developmental experiences, strengths, and beliefs. Alex believes in a holistic approach to treating mental health and chronic pain/symptoms, which addresses root causes including trauma, nervous system dysregulation, neuroplasticity, and systemic challenges.\n\n\n  Alex is also a life-long musician, lending this skill as the music producer and sound designer for the Mind-Body Couple podcast and MBody Community.\n\n\n  Pain Psychotherapy Canada\n\n  MBody Community",
    "local_image_path": "images/Alex_Klassen_MSW_RSW.jpg"
  },
  {
    "name": "Shoshana Krohner, PhD",
    "title": "Clinical Psychologist",
    "subtitle": "Attending Psychologist",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/2782107d-4fa4-4619-89df-b7f68ef0ad1e/Shoshana+Krohner.jpeg?format=2500w",
    "bio": "Dr. Shoshana Krohner is an attending psychologist at Montefiore Medical Center in the Bronx, NY, and also maintains a private practice. She specializes in the treatment of chronic pain using a mind-body approach that integrates psychological, relational, and neurobiological perspectives. Dr. Krohner is actively involved in clinical research, collaborating on studies that test innovative psychological interventions for chronic pain.\n\n\n  She earned her PhD in clinical psychology from Wayne State University and completed her predoctoral internship at Emory University School of Medicine. Her postdoctoral fellowship at Montefiore focused on trauma and attachment disruptions, with an emphasis on mentalizing-based treatment approaches.\n\n\n  Dr. Krohner has a strong track record of publication in peer-reviewed journals, with scholarly work addressing chronic pain, trauma, and attachment. Her clinical and academic work bridges the gap between research and practice, aiming to deepen understanding and improve care for patients living with persistent pain.",
    "local_image_path": "images/Shoshana_Krohner_PhD.jpeg"
  },
  {
    "name": "Mark A. Lumley, PhD",
    "title": "Distinguished Professor",
    "subtitle": "Department of Psychology, Wayne State University, Detroit, Michigan, USA",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/94db4cb4-cdd9-4e15-b6bc-05a83a7e7399/Mark+Lumley+2022+%281.1%29.jpg?format=2500w",
    "bio": "Mark A. Lumley, Ph.D., is a clinical psychologist and Distinguished Professor in the Department of Psychology at Wayne State University, Detroit, Michigan. His research program is internationally recognized for understanding how emotional processes, such as the lack of emotional awareness, or “alexithymia,” and lack of emotional expression is related to pain and other somatic symptoms. Dr. Lumley has been funded by the NIH for many years and has over 210 peer-reviewed articles. He is on the editorial boards of numerous journals in health psychology, pain, and psychosomatic medicine and is a Fellow of multiple professional societies. Along with his colleagues and students, he has developed and tested various emotion-focused psychological interventions, such as written or spoken emotional disclosure and most recently Emotional Awareness and Expression Therapy (EAET), which has been supported by multiple clinical trials for chronic pain and related conditions.  He also has contributed to the development and testing of Pain Reprocessing Therapy. In collaboration with his close colleague, Dr. Howard Schubiner, he has trained hundreds of health professionals in EAET.   In his clinical psychology doctoral program, Dr. Lumley has mentored nearly 50 doctoral students to the Ph.D. and received a national award for mentoring.",
    "local_image_path": "images/Mark_A_Lumley_PhD.jpg"
  },
  {
    "name": "Deb Malkin",
    "title": "Mindbody Coach + Hypnotist",
    "subtitle": "Creator + Host of The Curiosity Cure Podcast",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/22884cec-59a7-4412-901e-d806a47a4327/Deb+Malkin+Headshot.jpg?format=2500w",
    "bio": "Deb Malkin (she/they) is a queer elder, feminist, certified mindbody pain recovery coach and hypnotist helping clients recover from back pain, migraines, fibromyalgia, gi pain and more. Deb encountered this work while as a massage therapist which facilitated a radical transformation in their own chronic musculoskeletal pain as well as a radical shift in her healing practice. She originally studied with Charlie Merrill and Dr. Howard Schubiner, and has since trained in EAET, PRT, and Integrative Medical Hypnosis. As a co-founder of the Weight Stigma and Neuroplastic Symptoms Working Group (WSNSWG), Deb is particularly interested in helping people and communities who are affected by stigma, oppression, racism and more to understand how chronic social threat influences chronic pain + symptoms and how modern pain neuroscience can offer hope for symptom recovery. Deb has these conversations and more on The Curiosity Cure Mindbody Wellness Podcast.\n\n\n  thecuriositycure.com\n\n  The Curiosity Cure Podcast",
    "local_image_path": "images/Deb_Malkin.jpg"
  },
  {
    "name": "Matt McClanahan, DO, MA",
    "title": "Osteopathic Physician",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/032f181c-5226-48d3-b160-24574a1e2bb5/Best+Blue.jpg?format=2500w",
    "bio": "Dr. Matt McClanahan is an osteopathic physician dual-boarded in Family Medicine and Neuromusculoskeletal Medicine. His diverse experience spans primary care, osteopathic manual treatment, integrative medicine, addiction care, ISTDP, psychedelic somatic therapy, and end-of-life support. He holds both basic and mastery certifications in Pain Reprocessing Therapy (PRT).\n\n\n  His passion for treating chronic pain and mind-body syndromes was sparked in 2012 through work with Dr. Howard Schubiner. In 2018, Dr. Matt founded the Center for Insight Medicine, a consultative clinic specializing in neuroplastic symptom care. He is also senior faculty with the Freedom From Chronic Pain training group and serves as the physician lead for the PRT arm of the PUPPY Trial—a major follow-up to the original PRT study.\n\n\n  He lives and practices in Chattanooga, TN.",
    "local_image_path": "images/Matt_McClanahan_DO_MA.jpg"
  },
  {
    "name": "Tanner Murtagh MSW, RSW",
    "title": "Director of MBody Community",
    "subtitle": "Therapist",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/49990ba2-d824-4659-a4c8-e250d8720231/Tanner+Murtagh+Headshot.jpg?format=2500w",
    "bio": "Tanner Murtagh is the director of Pain Psychotherapy Canada, a therapy clinic that specializes in psychological approaches to help individuals reduce chronic neuroplastic pain and symptoms. He is also the co-director of MBody Community, an online course that provides education, strategies and practices for individuals recovering from neuroplastic pain and symptoms.\n\n\n  Tanner is passionate about helping people heal their chronic pain and symptoms. His therapeutic approach involves supporting people in changing their thoughts and beliefs about their symptoms, using brain retraining and graded exposure, regulating their nervous system, processing emotions and trauma, and creating social safety. Tanner creates and provides free community resources by posting weekly education and practices on YouTube, Instagram, and the Mind-Body Couple Podcast.\n\n\n  Personally, Tanner recovered from years of widespread chronic pain utilizing the approach he now provides his clients.\n\n\n  Pain Psychotherapy Canada\n\n  MBody Community",
    "local_image_path": "images/Tanner_Murtagh_MSW_RSW.jpg"
  },
  {
    "name": "Marjon Oomens, MSc",
    "title": "Co-founder & Director",
    "subtitle": "Emovere Foundation",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/5f18f5ea-b34e-41cf-ab92-9261be6f8581/Screenshot+2025-04-16+at+12.57.59%E2%80%AFPM.png?format=2500w",
    "bio": "Marjon Oomens studied Business Administration at the Erasmus University in Rotterdam and worked internationally for over 20 years as a business manager. After struggling with unresolved chronic pain for years, she fully recovered in three months using mind-body-emotion work. This transformation inspired her to leave her corporate career and co-found the Emovere Foundation in the Netherlands.\n\n\n  The Emovere Foundation promotes emotional awareness and the mind-body connection to provide more options for healing chronic pain and other persistent symptoms, for prevention and self-management. As a non-profit organisation, Emovere relies on dedicated volunteers and strategic partnerships. With over 2,200 active supporters and 11,000 followers, the foundation is building a grassroots movement to shift the healthcare paradigm through inspiring, educating en connecting people.\n\n\n  www.stichtingemovere.nl\n\n  www.depijnvoorbij.nl\n\n\n  Tip:With a simple right-hand mouse click on the website, Google Translate will show the website in your own language.",
    "local_image_path": "images/Marjon_Oomens_MSc.png"
  },
  {
    "name": "Dr. Phil Parker, PhD, DO, Dip E Hyp Psych",
    "title": "Psychologist, Osteopath & Brain Training Innovator",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/7c0c5fde-e843-445e-9ef3-1abb61e25f4f/xOOn7DaB.png?format=2500w",
    "bio": "Dr. Phil Parker is a psychologist, lecturer and innovator in the field of brain training. Much of his work has focused on how the brain can be used to affect physiology. In 1999, he designed the brain retraining programme, the Lightning Process, for chronic health issues, which has been the subject of 18 research papers, is available in 22 countries and has helped over 75,000 people.\n\n\n  Phil has also worked with performers at the highest level, including Premiership footballers, European Tour golfers, the British Olympic medical team, and was the performance psychologist for Ed Stafford’s successful Guinness World Record attempt to walk the Amazon.\n\n\n  He graduated as an osteopath in 1988 and was awarded a PhD in the Psychology of Health for his research into a new approach for addictions and substance use. His publications include papers and books on the brain-mind-body connection and health, which have been translated into a range of languages.\n\n\n  www.philparker.org",
    "local_image_path": "images/Dr_Phil_Parker_PhD_DO_Dip_E_Hyp_Psych.png"
  },
  {
    "name": "Karden Rabin",
    "title": "Nervous System Medicine Practitioner",
    "subtitle": "Co-Founder of Somia International",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/5dcf30cc-cd6e-4b23-a13a-dc6c435d7c7b/Karden+Headshot+1+compressed.jpg?format=2500w",
    "bio": "Karden Rabin is the cofounder of Somia International, coauthor of The Secret Language of the Body: Regulate Your Nervous System, Heal Your Body, Free Your Mind, and a nervous system medicine practitioner who specializes in treating chronic pain and illness. As an expert in the field of stress, trauma, and psychophysiology, his work is dedicated to helping people heal the root causes of their symptoms so they can live productive and fully expressed lives.\n\n\n  Karden was able to eliminate decades-long debilitating back pain by studying the psychoemotional and neurological underpinning of chronic pain and stress-based disorders. Driven by his own personal healing experience, he has helped thousands of clients all over the world end their suffering through his self-healing platform, HEAL, combining the principles of bodywork, brain retraining, and somatic trauma therapies.\n\n\n  Over the past decade, Karden has developed and led programming for The Wounded Warrior Project and Starbucks. He is also a regular contributor to Bessel Van Der Kolk’s Trauma Research Foundation.\n\n\n  somiainternational.com\n\n  The Secret Language of the Body",
    "local_image_path": "images/Karden_Rabin.jpg"
  },
  {
    "name": "Alexander Rosan",
    "title": "Massage Therapist, Bodyworker",
    "subtitle": "Specializing in How Emotions and Trauma are Stored and Released in the Body",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/b1a6ba4d-1a7b-46cd-9f7f-d6463edc427e/Screenshot+2025-06-05+at+2.50.21%E2%80%AFPM.jpg?format=2500w",
    "bio": "Alexander Rosan is a somatic therapist renowned for his ability to help clients release deep, unresolved pain stored in the body. With advanced training in Barral’s Visceral Manipulation and years of clinical experience, he weaves together manual therapy, breathwork, movement, and trauma-informed care to support profound transformation. Based in Portland, Oregon, Alexander works with a wide range of clients—including those who have tried everything else—helping them move beyond relief to real embodied change. His approach is intuitive, grounded, and rooted in a belief that the body always knows the way through.",
    "local_image_path": "images/Alexander_Rosan.jpg"
  },
  {
    "name": "David Schechter, MD",
    "title": "Sports & Family Medicine",
    "subtitle": "Physician",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/ab74d143-b459-441f-981b-21ae432cd8d5/unnamed-3.jpg?format=2500w",
    "bio": "Dr. David Schechter is a physician in West Los Angeles, California. He met Dr. John Sarno as a patient and later became a research assistant. He was the first medical student to take an interest in Dr. Sarno’s work in neuroplastic symptoms or tension myoneural syndrome (TMS). Dr. Schechter attended Princeton University, received his MD from New York University, residency through UCLA/Santa Monica, and is an attending physician at Cedars-Sinai Medical Center. He has been named a Top Doctor for over 20 years.\n\n\n  He has written several books, including Think Away Your Pain, The MindBody Workbook, The MindBody Workbook for Teens, and The Lessons Doctor Sarno Taught Me. He has co-created an online program called The MindBody Healing Journey and co-authored The MindBody Workbook, Volume Two and A Diagnostic Guide for Psychophysiologic Disorders. Recently, he created an online course, Mastering the Mind-Body Connection for Teenagers.\n\n\n  mindbodymedicine.com",
    "local_image_path": "images/David_Schechter_MD.jpg"
  },
  {
    "name": "Amy Schere, MSW, LCSWA, PT, DPT",
    "title": "Psychotherapist",
    "subtitle": "Physical Therapist",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/00253c54-e7fa-4315-868d-4d01aa233035/ASchereHeadshotScaled.jpg?format=2500w",
    "bio": "Amy Schere is currently practicing as a psychotherapist based in Raleigh, North Carolina, at her group practice Third Wave Psychotherapy. She provides therapy to individuals and groups with a focus on seeing clients with neuroplastic symptoms, anxiety, depression, trauma, and eating disorders/body image concerns. Amy uses a Health at Every Size lens when working with all of her clients and is passionate about providing a size-inclusive approach.\n\n\n  Amy received her Doctor of Physical Therapy from Columbia University and practiced for 10 years as a physical therapist specializing in patients with neurological conditions. After finding her own relief from chronic pain through the mind-body approach, she began offering the mind-body approach to her patients as a PT. Amy eventually returned to school and obtained her Masters in Social Work from UNC-Chapel Hill to be able to turn her focus to providing psychotherapy for clients with neuroplastic symptoms, as well as other mental health conditions. She enjoys working through a holistic lens and bringing her clients thorough knowledge of both the mind and body. Amy is also trained in Internal Family Systems therapy, which she enjoys integrating with Pain Reprocessing Therapy for many of her clients.\n\n\n  Third Wave Psychotherapy",
    "local_image_path": "images/Amy_Schere_MSW_LCSWA_PT_DPT.jpg"
  },
  {
    "name": "Howard Schubiner, MD",
    "title": "Clinical Professor, Michigan State University College of Human Medicine",
    "subtitle": "Cormendihealth.com",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/313ab4c9-0b30-4afb-b635-904280e3025d/Picture+from+Monique+Sondag.JPG?format=2500w",
    "bio": "Dr. Howard Schubiner is an internist, Clinical Professor at Michigan State University College of Human Medicine, and internationally recognized expert in chronic pain. He has authored over 100 scientific publications and consulted for major institutions including the AMA, NIDA, and NIMH. He developed two leading psychological treatments for chronic pain—Emotion Awareness and Expression Therapy (EAET) and Pain Reprocessing Therapy (PRT)—which have been proven effective in clinical trials.\n\n\n  Dr. Schubiner is the author of three influential books: Unlearn Your Pain, Unlearn Your Anxiety and Depression, and Hidden From View (with Dr. Allan Abbass). His work is listed in the U.S. Department of Health and Human Services Pain Management Best Practices Report.\n\n\n  He sees patients virtually worldwide through CormendiHealth.com and lives in Detroit with his wife of 40 years. They have two adult children.",
    "local_image_path": "images/Howard_Schubiner_MD.JPG"
  },
  {
    "name": "Kate Smith, ND",
    "title": "Naturopathic Doctor",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/b5bd72d7-df00-4f89-acbd-fa966ec1a989/Untitled-design-2.png?format=2500w",
    "bio": "Kate Smith, N.D. is a licensed Naturopathic physician who specializes in the treatment of chronic pain and women’s health conditions through mind-body medicine rooted in neuroscience. Her personal journey with chronic pain created an opportunity to delve into this field of medicine wholeheartedly.\n\n\n  She is trained in the diagnosis and treatment of chronic pain conditions and is certified in Pain Reprocessing Therapy™ (PRT) and Emotional Expression and Awareness Therapy (EAET). Kate brings a holistic, compassionate approach to her practice to help patients experience freedom from chronic symptoms.",
    "local_image_path": "images/Kate_Smith_ND.png"
  },
  {
    "name": "Jonathan Takahashi, MD, MPH",
    "title": "Clinical Associate Professor",
    "subtitle": "UW Department of Family Medicine and Osher Center for Integrative Health",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/38974b3f-546c-4a83-a956-b8b4c45b3905/Takahashi_Jonathan_MD%2C+MPH_headshot+photo.jpeg?format=2500w",
    "bio": "Jonathan Takahashi, MD, MPH is a Clinical Associate Professor in the Department of Family Medicine and Community Health and the Osher Center for Integrative Health at the University of Wisconsin-Madison School of Medicine and Public Health. He is a graduate of Harvard Medical School and the Harvard School of Public Health, the University of Wisconsin-Madison Family Medicine Residency, and the University of Wisconsin-Madison Academic Integrative Health Fellowship.\n\n\n  His work includes patient care, research, and teaching medical students, residents, and fellows. His current clinical work includes primary care family medicine, seeing patients on a referral basis in the UW Health Integrative Health Consult Clinic, and leading Healing Chronic Pain group medical visits (GMVs).\n\n\n  He utilizes a patient-centered, Whole Health approach, incorporating nutrition, mindfulness, yoga, meditation, neurophysiology education, Pain Reprocessing Therapy (PRT), Emotional Awareness and Expression Therapy (EAET), Osteopathic Manual Therapy (OMT), movement therapies, and other methods to support healing and recovery for patients with chronic pain and other health conditions.",
    "local_image_path": "images/Jonathan_Takahashi_MD_MPH.jpeg"
  },
  {
    "name": "Leonida Tansinsin, MPT",
    "title": "Physical Therapist & Athletic Trainer",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/789e26e3-4f4b-47d1-bc10-ed3a10b5aca3/HEADSHOT.2025.jpg?format=2500w",
    "bio": "Leonida Tansinsin is a classically trained athletic trainer and physical therapist with over 20 years of experience. She earned her Kinesiology degree from Indiana University Bloomington in 2000 and later completed her Physical Therapy degree at Sacramento State University.\n\n\n  Leonida has worked across a wide spectrum of clinical settings—from college and professional athletics to acute care, skilled nursing, home health, and outpatient rehab. Her interest in mind-body approaches began during her time in Colorado, helping design a new pain treatment method for total knee replacements. She has since integrated neuroplastic and mind-body principles into her chronic and acute pain work.\n\n\n  She was the primary chronic pain specialist at Kaiser Olympia and currently works alongside Dr. Rebecca Kennedy at Resilience Healthcare. She also continues clinical work at an outpatient PT clinic in Steilacoom, WA treating patients of all levels and function.",
    "local_image_path": "images/Leonida_Tansinsin_MPT.jpg"
  },
  {
    "name": "Camille Thoman",
    "title": "Embodiment Coach",
    "subtitle": "Film & Video Game Director",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/93235809-a475-4652-9f74-4e210e536051/Camille+Thoman+Headshot.jpg?format=2500w",
    "bio": "Camille Thoman is an award-winning film and video game writer/director and embodiment coach. Her work with professionals draws on years of coaching Oscar- and Emmy-winning actors, alongside a decade of deep training in somatic communication and embodied leadership  Camille's acclaimed film Never Here starring Mireille Enos and Sam Shepard was released in theaters in 2018.  Her documentary The Longest Game has been airing on PBS since 2018. Upcoming films include The Gate (2026), co-written with Emmy winner Tobias Menzies and Whole (2027), for Serendipity Point Pictures (Eastern Promises). Camille began her career devising & performing somatic movement piece Numb, which ran at The Young Vic in London and aired on the BBC.",
    "local_image_path": "images/Camille_Thoman.jpg"
  },
  {
    "name": "Rebecca Tolin, BA",
    "title": "Mind-Body Coach",
    "subtitle": "Creator of Be Your Own Medicine Course",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/1be203ff-8b18-4e59-9980-f1ceeb73e9d7/Rebecca+Tolin.jpeg?format=2500w",
    "bio": "Rebecca Tolin is a mind-body coach, educator, and writer who comes to this field through a 13-year saga with chronic fatigue syndrome and other disabling neuroplastic symptoms. After seeing 50 practitioners, Rebecca finally recovered through the ATNS model. This experience was so profound, she’s devoted her work to helping people with CFS, Long Covid, and other neuroplastic conditions. \n\n\n  Rebecca is the creator of the Be Your Own Medicine course, which blends mind-body education with somatic meditation, emotional awareness, exposure therapy, and nervous system regulation. She spreads science and story through her blog and YouTube channel. Prior to this career, Rebecca worked as a broadcast journalist for ABC, NBC, and PBS affiliates. You can learn more about Rebecca through her website.",
    "local_image_path": "images/Rebecca_Tolin_BA.jpeg"
  },
  {
    "name": "Christie Uipi, LCSW",
    "title": "Psychotherapist & Health Coach",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/6845499a-8ecf-4ce1-a469-af0974fdd943/CUipi+2025+Headshot.jpg?format=2500w",
    "bio": "Christie (she/her) is the Executive Director of The Better Mind Center and a psychotherapist specializing in the treatment of chronic pain, anxiety, and depression. Christie is also a recovered chronic pain patient herself. The healing process was so profoundly transformational for her quality of life that she has dedicated her career to supporting others through their recoveries.\n\n\n  She lectures nationally on psychotherapeutic interventions to treat chronic pain and is committed to cross-disciplinary collaboration between mental health and physical medicine. Christie worked alongside Alan Gordon and Dr. Howard Schubiner to develop Pain Reprocessing Therapy.",
    "local_image_path": "images/Christie_Uipi_LCSW.jpg"
  },
  {
    "name": "William H. Watson, PhD",
    "title": "Associate Professor of Psychiatry and Neurology",
    "subtitle": "",
    "image_url": "https://images.squarespace-cdn.com/content/v1/668cb864db303d0bdbeeccad/82f21ad5-03b9-49d3-b3a3-77a349fafe73/PsychID_0080.JPG?format=2500w",
    "bio": "William H. Watson, Ph.D., is Associate Professor of Psychiatry and Neurology at the University of Rochester Medical Center and senior psychologist with the Epilepsy Center of Strong Memorial Hospital. The recipient of numerous teaching awards, for over 30 years Dr. Watson has taught individual, family, and group psychotherapy at the graduate and post-graduate level, as well as sharing his work on psychodynamic approaches to the treatment of patients with mind-body disorders in graduate courses, seminars, and invited lectures nationally and internationally.\n\n\n  Dr. Watson is a Fellow of American Psychological Association and past president of The Society for Family Psychology (APA Division 43), which named him the 2009 APA Family Psychologist of the Year. He is also an AGPA-Certified Group Psychotherapist and trained at the Center for Group Studies in New York City in modern analytic group therapy. In addition, he has done Core Training and Advanced Training in Intensive Short-Term Dynamic Psychotherapy (ISTDP) with Allan Abbass, M.D. and Joel Town, Ph.D. Primary areas of interest are the use of EDTs in understanding and treating functional neurological disorders (PNEA in particular), the use of experiential process groups in training healthcare and mental health professionals, and spirituality in psychotherapy.",
    "local_image_path": "images/William_H_Watson_PhD.JPG"
  }
]